USE doc_flow;

INSERT INTO departments VALUES
	(NULL, 'департамент систем управления'),
	(NULL, 'департамент реализации инвестиционных проектов'),
	(NULL, 'департамент капитального строительства'),
	(NULL, 'руководство');

INSERT INTO divisions VALUES
	(NULL, 'отдел ОСС', 1),
	(NULL, 'отдел АСУТП', 1),
	(NULL, 'отдел РЗАиПА', 1),
	(NULL, 'отдел подготовки проектов', 2),
	(NULL, 'отдел бюджетирования и финансирования', 2),
	(NULL, 'отдел сметной аналитики', 2),
	(NULL, 'генплана, силового оборудования и транспорта', 3),
	(NULL, 'архитектурный отдел', 3),
	(NULL, 'аппарат генерального директора', 4);
	
INSERT INTO positions VALUES
	(NULL, 'специалист 3 категории'), (NULL, 'специалист 2 категории'),
	(NULL, 'специалист 1 категории'), 	(NULL, 'ведущий специалист'),
	(NULL, 'главный специалист'), (NULL, 'начальник отдела'),
	(NULL, 'главный иженер'), (NULL, 'заместитель генерального директора'),
	(NULL, 'генеральный директор'), (NULL, 'секретарь');
	
INSERT INTO phone_numbers VALUES 
	(NULL, 88125555550), (NULL, 88125555551), (NULL, 88125555552), (NULL, 88125555553), 
	(NULL, 88125555554), (NULL, 88125555555), (NULL, 88125555556), (NULL, 88125555557),
	(NULL, 88125555558), (NULL, 88125555559), (NULL, 88125555560), (NULL, 88125555561), (NULL, 88125555562);
	
INSERT INTO stages VALUES (NULL, 'ПД'), (NULL, 'РД'), (NULL, 'КД'), (NULL, 'ППО');

INSERT INTO cities VALUES 
	(NULL, 'Москва'), (NULL, 'Санкт-Петербург'), (NULL, 'Кемерово'), 
	(NULL, 'Красноярск'), (NULL, 'Самара'),  (NULL, 'Екатеринбург');

INSERT INTO expertises VALUES
	(NULL, 'ФАУ Главгосэкспертиза России', 1, 'Фуркасовский пер., д. 6', 'info@gge.ru', 74956259595),
	(NULL, 'ГАУ Леноблэкспертиза', 2, 'Малоохтинский пр., дом 68', 'info@loexp.ru', 78123334763),
	(NULL, 'ГАУ Госэкспертиза Кузбасса', 3, 'ул. Терешковой, д.18', 'ekspertko@mail.ru', 73842346601),
	(NULL, 'ГАУ Московская государственная экспертиза', 1, 'ул.2-я Брестская, д. 8', 'info@mge.mos.ru', 74992510170),
	(NULL, 'ГАУ Центр государственной экспертизы', 2, 'ул. Зодчего Росси, дом 1/3', 'info@spbexp.ru', 78127770432);

INSERT INTO subcontractors VALUES
	(NULL, 'АО СмартТехПроект', 2, 'пл. Ал. Невского д.2 лит.Б', 'office@rosproject.com', 88124564755, 'Семенова С.А.', 'Иванов П.П.'),
	(NULL, 'АО ЭнергоПроект', 2, 'ул. Боровая, д. 32, лит. Н', 'info@energopro.ru', 78122427169, 'Николаев Н.Н.', 'Максимов М.М.'),
	(NULL, 'ЗАО Энергопроект', 1, 'Каширское ш., д.22к3', 'info@ntc-power.ru', 74957271909, 'Борисов Б.Б.', 'Столов М.В.'),
	(NULL, 'ООО Петроком', 2, 'Мурзинская ул., 11', 'info@petrokom.com', 88123312517, 'Артемов А.А.', 'Светлов М.В.'),
	(NULL, 'АО Атомпроект', 1, 'пл. Свободы, д.3', 'niaep@ase-ec.ru', 84953312617, 'Григорьев Г.Г.', 'Листьев М.А.');

INSERT INTO gencontractors VALUES
	(NULL, 'ООО ЛЭМ', 1, 'Киевское шоссе, 22-й км', 'info@lem-ltd.ru', 74996840016, 'Афанасьев Б.А.', 'Кукуев Х.П.'),
	(NULL, 'ООО АРСЕНАЛ ПЛЮС', 1, '1-й Дербеневский пер., д. 5', 'info@arsenal-pl.ru', 74993725261, 'Иванова З.Н.', 'Лепский М.О.'),
	(NULL, 'ЗАО Юнител Инжиниринг', 1, '2-я Кабельная, д. 2, стр.1', 'info@uni-eng.ru', 74956519998, 'Рыжов А.Б.', 'Дегтярев А.В.'),
	(NULL, 'ООО АББ', 2, 'Гельсингфорсская ул., 4', 'info@abb.com', 78123329900, 'Дулов В.А.', 'Арбенин М.Л.');	
	
INSERT INTO customers VALUES
	(NULL, 'ПАО ФСК ЕЭС МЭС Центра', 1, 'ул. Беловежская, д. 4', 'center@fsk-ees.ru', 74957109655, 'Муров Б.А.', 'Абрамов И.П.'),
	(NULL, 'ПАО Ленэнерго', 2, 'ул.Красного Текстильщика, 10-12', 'service@lenenergo.ru', 74993725261, 'Швецов С.Н.', 'Абрамович М.А.'),
	(NULL, 'ОАО РЖД', 1, 'Москва, Новая Басманная ул., д. 2', 'office@css.rzd.ru', 74992629095, 'Калашников В.Б.', 'Путин В.В.'),
	(NULL, 'ПАО ФСК ЕЭС МЭС Северо-Запада', 2, 'Пироговская наб., 9a', 'sz@fsk-ees.ru', 78127109655, 'Мурова Н.Н.', 'Абрамчук И.А.'),
	(NULL, 'ПАО ФСК ЕЭС МЭС Сибири', 4, 'ул. Ады Лебедевой, 117', 'adm@sibir.fsk-ees.ru', 73912659500, 'Мишустин Н.Н.', 'Трамп И.А.'),
	(NULL, 'ПАО ТГК-1', 2, 'пр. Добролюбова, 16, корп.2, литера А', 'office.krl@tgc1.ru', 78127122655, 'Солнцев Х.Н.', 'Медведева И.А.'),
	(NULL, 'ПАО ФСК ЕЭС МЭС Волги', 5, 'ул. Молодогвардейская, 226', 'mesvolgi@volga.fsk-ees.ru', 78463396359, 'Заплатин Н.Х.', 'Ковров И.Р.'),
	(NULL, 'ПАО ФСК ЕЭС МЭС Урала', 6, 'ул. Толмачева, 10', 'secretar@ural.fsk-ees.ru', 73433729359, 'Петрович Н.О.', 'Цукурберг М.А.');	

INSERT INTO employees (id,  lastname, firstname, middlename, department_id, division_id, email, phone_id, position_id) VALUES
	(NULL, 'Чебаков', 'Виталий', 'Константинович', 1, 1, 'chebakov_vk@cius-ees.ru', 1, 5),
	(NULL, 'Соколов', 'Владимир', 'Дмитриевич', 1, 1, 'sokolov_vd@cius-ees.ru', 1, 6),
	(NULL, 'Костенко', 'Сергей', 'Георгиевич', 1, 1, 'kostenko_sg@cius-ees.ru', 1, 4),
	(NULL, 'Ткачев', 'Дмитрий', 'Иванович', 1, 2, 'tkachev_di@cius-ees.ru', 2, 4),
	(NULL, 'Зубов', 'Михаил', 'Сергеевич', 1, 2, 'zubov_ms@cius-ees.ru', 2, 3),
	(NULL, 'Мороз', 'Денис', 'Петрович', 1, 2, 'moroz_dp@cius-ees.ru', 2, 6),
	(NULL, 'Мамонтов', 'Игорь', 'Юрьевич', 1, 3, 'mamontov_iu@cius-ees.ru', 3, 4),
	(NULL, 'Коваленко', 'Иван', 'Владимирович', 1, 3, 'kovalenko_iv@cius-ees.ru', 3, 6),
	(NULL, 'Ковалев', 'Валентин', 'Сергеевич', 2, 4, 'kovalev_vs@cius-ees.ru', 4, 4),
	(NULL, 'Ковалев', 'Алексей', 'Валентинович', 2, 4, 'kovalev_av@cius-ees.ru', 4, 6),
	(NULL, 'Самойлова', 'Ирина', 'Сергеевна', 2, 5, 'samoilova_is@cius-ees.ru', 5, 5),
	(NULL, 'Петров', 'Алексей', 'Валентинович', 2, 5, 'petrov_av@cius-ees.ru', 5, 6),
	(NULL, 'Васильева', 'Галина', 'Петровна', 2, 6, 'vasilieva_gp@cius-ees.ru', 6, 2),
	(NULL, 'Павлов', 'Евгений', 'Александрович', 2, 6, 'pavlov_ea@cius-ees.ru', 6, 6),
	(NULL, 'Васильева', 'Ирина', 'Петровна', 3, 7, 'vasilieva_ip@cius-ees.ru', 7, 4),
	(NULL, 'Павлов', 'Леонид', 'Александрович', 3, 7, 'pavlov_la@cius-ees.ru', 7, 6),
	(NULL, 'Васильев', 'Петр', 'Петрович', 3, 8, 'vasiliev_pp@cius-ees.ru', 8, 5),
	(NULL, 'Павлов', 'Иван', 'Александрович', 3, 8, 'pavlov_ia@cius-ees.ru', 8, 6),
	(NULL, 'Шуринов', 'Василий', 'Александрович', 4, 9, 'shurinov_va@cius-ees.ru', 9, 7),
	(NULL, 'Семенов', 'Петр', 'Петрович', 4, 9, 'semenov_pp@cius-ees.ru', 10, 8),
	(NULL, 'Бадайкин', 'Антон', 'Леонидович', 4, 9, 'badaikin_al@cius-ees.ru', 11, 9),
	(NULL, 'Петрова', 'Эвелина', 'Петровна', 4, 9, 'office@cius-ees.ru', 12, 10);

INSERT INTO projects VALUES 
	(NULL, '4 участок ВЛ 330 кВ Кольская АЭС-Княжегубская ГЭС, ПС 330 кВ Лоухи-Путкинская ГЭС', 'ПИР-101', 4, 2, 1, '2018-06-06', '2019-07-01', 1),
	(NULL, 'ПС 330 кВ Василеостровская с КЛ 330 кВ Василеостровская-Северная', 'ПИР-111', 4, 1, 1, '2018-04-08', '2019-12-01', 1),
	(NULL, 'ПС 110 кВ \'Намыв-2\' с КЛ 110 кВ', 'ПИР-115', 2, 4, 2, '2018-04-08', '2019-12-05', 5),
	(NULL, 'Комплексное техническое перевооружение ПС 500 кВ Бескудниково', 'ПИР-118', 1, 1, 1, '2018-05-12', '2019-10-02', 1),
	(NULL, 'ВЛ 330 кВ Псков-Лужская', 'ПИР-119', 4, 2, 1, '2018-06-15', '2019-12-02', 2),
	(NULL, 'Строительство ПС 500 кВ Белобережская', 'ПИР-121', 4, 1, 3, '2018-06-22', '2019-12-28', 4),
	(NULL, 'Строительство ПС 330 кВ Мурманская', 'ПИР-125', 4, 2, 3, '2018-12-22', '2020-05-28', 2),
	(NULL, 'Строительство ВЛ 220 кВ Харанорская ГЭС - Бугдаинская - Быстринская', 'ПИР-130', 5, 1, 1, '2019-01-22', '2020-06-28', 3),
	(NULL, 'Комплексная реконструкция ПС 330 кВ Колпино', 'ПИР-141', 4, 1, 4, '2019-01-23', '2020-07-20', 2),
	(NULL, 'Техническое перевооружение ТП Черная Восточно-Сибирской ж.д.', 'ПИР-145', 3, 4, 4, '2019-02-25', '2020-02-26', 3),
	(NULL, 'Строительство КВЛ Ленинградская АЭС-2 - Пулковская - Южная', 'ПИР-165', 6, 1, 5, '2019-03-25', '2020-04-01', 5),
	(NULL, 'Реконструкция и расширение ПС 110 кВ \'Красный Октябрь\'', 'ПИР-168', 2, 3, 2, '2019-03-25', DEFAULT, 5),
	(NULL, 'Реконструкция ОРУ 110 кВ ЭС-1 Центральной ТЭЦ филиала Невский', 'ПИР-170', 6, 1, 1, '2019-04-01', DEFAULT, 2),
	(NULL, 'Техническое перевооружение ТП Старый Оскол. Организация ССПИ', 'ПИР-172', 3, 3, 4, '2020-01-29', DEFAULT, 4),
	(NULL, 'Схема выдачи мощности второй очереди ЛАЭС-2', 'ПИР-174', 1, 2, 5, '2020-05-15', DEFAULT, 4);
	
INSERT INTO documentation VALUES
	-- '4 участок ВЛ 330 кВ Кольская АЭС-Княжегубская ГЭС, ПС 330 кВ Лоухи-Путкинская ГЭС'
	(NULL, 'Л0007-ИОС4', 'Автоматизированная система управления технологическими процессами', 1, 1, '2018-06-06', '2019-01-20', 4, NULL),
	(NULL, 'Л0007-ИОС5', 'Релейная защита и противоаварийная автоматика', 1, 1, '2018-06-06', '2019-01-20', 4, NULL),
	(NULL, 'Л0007-ИОС6', 'Сети связи', 1, 1, '2018-06-06', '2019-01-20', 4, 'ЦСПИ, ВЧ'),
	(NULL, '0007-150-АСУ', 'Автоматизированная система управления технологическими процессами', 1, 2, '2018-07-06', '2019-06-20', 4, NULL),
	(NULL, '0007-102-РЗ', 'Релейная защита и автоматика', 1, 2, '2018-07-06', '2019-06-20', 4, NULL),
	(NULL, '0007-114-РЗ', 'Параметрирование терминалов РЗ и ПА', 1, 2, '2018-07-06', '2019-06-20', 4, NULL),
	(NULL, '0007-025-СС', 'Внутриобъектные комплексы связи', 1, 2, '2018-07-07', '2019-06-20', 4, NULL),
	(NULL, '0007-004-СС', 'Станционные сооружения ВОЛС', 1, 2, '2018-07-20', '2019-06-20', 4, NULL),
	(NULL, '0007-ППО', 'Предпроектное обследование', 1, 4, '2018-06-15', '2018-10-28', 4, NULL),
	(NULL, '0007-КД', 'Конкурсная документация', 1, 3, '2018-09-20', '2018-11-30', 4, NULL),
	-- 'ПС 330 кВ Василеостровская с КЛ 330 кВ Василеостровская-Северная'
	(NULL, 'П0012-ИОС4', 'Автоматизированная система управления технологическими процессами', 2, 1, '2018-05-06', '2019-06-20', 4, NULL),
	(NULL, 'П0012-ИОС5', 'Релейная защита и противоаварийная автоматика', 2, 1, '2018-05-06', '2019-06-20', 4, NULL),
	(NULL, 'П0012-ИОС6', 'Сети связи', 2, 1, '2018-05-06', '2019-06-20', 4, 'ЦСПИ, ВЧ'),
	(NULL, '0012-150-АСУ', 'Автоматизированная система управления технологическими процессами', 2, 2, '2018-06-06', '2019-11-20', 4, NULL),
	(NULL, '0012-102-РЗ', 'Релейная защита и автоматика', 2, 2, '2018-06-06', '2019-11-20', 4, NULL),
	(NULL, '0012-114-РЗ', 'Параметрирование терминалов РЗ и ПА', 2, 2, '2018-06-06', '2019-11-22', 4, NULL),
	(NULL, '0012-025-СС', 'Внутриобъектные комплексы связи', 2, 2, '2018-06-07', '2019-11-22', 4, NULL),
	(NULL, '0012-004-СС', 'Станционные сооружения ВОЛС', 2, 2, '2018-07-23', '2019-11-22', 4, NULL),
	(NULL, '0012-ППО', 'Предпроектное обследование', 2, 4, '2018-05-15', '2018-09-28', 4, NULL),
	(NULL, '0012-КД', 'Конкурсная документация', 2, 3, '2018-09-20', '2018-11-25', 4, NULL),
	-- 'ПС 110 кВ 'Намыв-2' с КЛ 110 кВ'
	(NULL, 'П0115-ИОС4', 'Автоматизированная система управления технологическими процессами', 3, 1, '2018-06-06', '2019-02-05', 8, NULL),
	(NULL, 'П0115-ИОС5', 'Релейная защита и противоаварийная автоматика', 3, 1, '2018-06-06', '2019-02-05', 8, NULL),
	(NULL, 'П0115-ИОС6', 'Сети связи', 3, 1, '2018-06-06', '2019-02-05', 4, 'ЦСПИ'),
	(NULL, '0115-150-АСУ', 'Автоматизированная система управления технологическими процессами', 3, 2, '2018-07-06', '2019-10-05', 8, NULL),
	(NULL, '0115-102-РЗ', 'Релейная защита и автоматика', 3, 2, '2018-07-06', '2019-10-05', 8, NULL),
	(NULL, '0115-114-РЗ', 'Параметрирование терминалов РЗ и ПА', 3, 2, '2018-07-06', '2019-10-10', 8, NULL),
	(NULL, '0115-025-СС', 'Внутриобъектные комплексы связи', 3, 2, '2018-07-07', '2019-10-10', 8, NULL),
	(NULL, '0115-004-СС', 'Станционные сооружения ВОЛС', 3, 2, '2018-07-20', '2019-10-10', 8, NULL),
	(NULL, '0115-ППО', 'Предпроектное обследование', 3, 4, '2018-05-15', '2018-10-28', 8, NULL),
	(NULL, '0115-КД', 'Конкурсная документация', 3, 3, '2018-09-20', '2018-10-30', 8, 'техническая часть'),
	-- 'Комплексное техническое перевооружение ПС 500 кВ Бескудниково'
	(NULL, 'П330110-ИОС4', 'Автоматизированная система управления технологическими процессами', 4, 1, '2018-05-28', '2019-06-02', 3, NULL),
	(NULL, 'П330110-ИОС5', 'Релейная защита и противоаварийная автоматика', 4, 1, '2018-05-06', '2019-06-02', 3, NULL),
	(NULL, 'П330110-ИОС6', 'Сети связи', 4, 1, '2018-05-28', '2019-06-02', 3, 'ЦСПИ, ВЧ'),
	(NULL, '0110-150-АСУ', 'Автоматизированная система управления технологическими процессами', 4, 2, '2018-06-30', '2019-09-25', 3, NULL),
	(NULL, '0110-102-РЗ', 'Релейная защита и автоматика', 4, 2, '2018-06-30', '2019-09-25', 3, NULL),
	(NULL, '0110-114-РЗ', 'Параметрирование терминалов РЗ и ПА', 4, 2, '2018-06-30', '2019-09-25', 3, NULL),
	(NULL, '0110-025-СС', 'Внутриобъектные комплексы связи', 4, 2, '2018-07-01', '2019-09-25', 3, 'dect'),
	(NULL, '0110-004-СС', 'Станционные сооружения ВОЛС', 4, 2, '2018-07-01', '2019-05-25', 3, NULL),
	(NULL, '0110-ППО', 'Предпроектное обследование', 4, 4, '2018-06-20', '2018-08-12', 3, NULL),
	(NULL, '0110-КД', 'Конкурсная документация', 4, 3, '2019-01-20', '2019-11-25', 3, NULL),
	-- 'ВЛ 330 кВ Псков-Лужская'
	(NULL, 'Л0069-ИОС4', 'Автоматизированная система управления технологическими процессами', 5, 1, '2018-06-20', '2019-02-02', 3, NULL),
	(NULL, 'Л0069-ИОС5', 'Релейная защита и противоаварийная автоматика', 5, 1, '2018-06-20', '2019-02-02', 3, NULL),
	(NULL, 'Л0069-ИОС6', 'Сети связи', 5, 1, '2018-06-20', '2019-03-02', 3, 'ЦСПИ, ВЧ'),
	(NULL, '0069-150-АСУ', 'Автоматизированная система управления технологическими процессами', 5, 2, '2018-11-20', '2019-11-02', 3, NULL),
	(NULL, '0069-102-РЗ', 'Релейная защита и автоматика', 5, 2, '2018-11-20', '2019-10-02', 3, NULL),
	(NULL, '0069-114-РЗ', 'Параметрирование терминалов РЗ и ПА', 5, 2, '2018-11-20', '2019-11-01', 3, NULL),
	(NULL, '0069-025-СС', 'Внутриобъектные комплексы связи', 5, 2, '2018-07-01', '2019-07-02', 3, 'dect'),
	(NULL, '0069-024-СС', 'Система ВЧ-связи', 5, 2, '2018-07-01', '2019-07-02', 3, 'etl'),
	(NULL, '0069-004-СС', 'Станционные сооружения ВОЛС', 5, 2, '2018-12-20', '2019-07-02', 3, NULL),
	(NULL, '0069-ППО', 'Предпроектное обследование', 5, 4, '2018-07-20', '2018-08-30', 3, NULL),
	(NULL, '0069-КД', 'Конкурсная документация', 5, 3, '2019-11-01', '2019-11-20', 3, NULL),
	-- 'Строительство ПС 500 кВ Белобережская'
	(NULL, 'П0202-ИОС4', 'Автоматизированная система управления технологическими процессами', 6, 1, '2018-06-25', '2019-06-28', 10, NULL),
	(NULL, 'П0202-ИОС5', 'Релейная защита и противоаварийная автоматика', 6, 1, '2018-06-25', '2019-06-28', 10, NULL),
	(NULL, 'П0202-ИОС6', 'Сети связи', 6, 1, '2018-06-25', '2019-06-20', 10, 'ЦСПИ, ВЧ'),
	(NULL, '0202-150-АСУ', 'Автоматизированная система управления технологическими процессами', 6, 2, '2018-08-02', '2019-11-01', 10, NULL),
	(NULL, '0202-102-РЗ', 'Релейная защита и автоматика', 6, 2, '2018-08-02', '2019-11-01', 10, NULL),
	(NULL, '0202-118-РЗ', 'Параметрирование терминалов РЗ и ПА', 6, 2, '2018-08-02', '2019-11-01', 10, NULL),
	(NULL, '0202-025-СС', 'Внутриобъектные комплексы связи', 6, 2, '2018-08-02', '2019-11-01', 10, NULL),
	(NULL, '0202-024-СС', 'Система ВЧ-связи', 6, 2, '2018-08-02', '2019-11-01', 10, 'тритон'),
	(NULL, '0202-004-СС', 'Станционные сооружения ВОЛС', 6, 2, '2018-08-10', '2019-11-01', 10, NULL),
	(NULL, '0202-ППО', 'Предпроектное обследование', 6, 4, '2018-06-24', '2018-08-30', 10, NULL),
	(NULL, '0202-КД', 'Конкурсная документация', 6, 3, '2019-10-01', '2019-12-01', 10, NULL),
	-- 'Строительство ПС 330 кВ Мурманская'
	(NULL, 'П0272-ИОС4', 'Автоматизированная система управления технологическими процессами', 7, 1, '2018-12-26', '2020-01-28', 3, NULL),
	(NULL, 'П0272-ИОС5', 'Релейная защита и противоаварийная автоматика', 7, 1, '2018-12-26', '2020-01-28', 3, NULL),
	(NULL, 'П0272-ИОС6', 'Сети связи', 7, 1, '2018-12-26', '2020-01-28', 3, 'ЦСПИ'),
	(NULL, '0272-150-АСУ', 'Автоматизированная система управления технологическими процессами', 7, 2, '2019-02-26', '2020-04-05', 3, NULL),
	(NULL, '0272-102-РЗ', 'Релейная защита и автоматика', 7, 2, '2019-02-26', '2020-04-05', 3, NULL),
	(NULL, '0272-114-РЗ', 'Параметрирование терминалов РЗ и ПА', 7, 2, '2019-02-26', '2020-04-05', 3, NULL),
	(NULL, '0272-025-СС', 'Внутриобъектные комплексы связи', 7, 2, '2019-02-26', '2020-04-05', 3, 'dect'),
	(NULL, '0272-004-СС', 'Станционные сооружения ВОЛС', 7, 2, '2019-02-26', '2020-04-01', 3, NULL),
	(NULL, '0272-ППО', 'Предпроектное обследование', 7, 4, '2019-02-26', '2019-04-26', 3, NULL),
	(NULL, '0272-КД', 'Конкурсная документация', 7, 3, '2020-02-28', '2020-05-11', 3, NULL),
	-- 'Строительство ВЛ 220 кВ Харанорская ГЭС - Бугдаинская - Быстринская'
	(NULL, 'Л0355-ИОС4', 'Автоматизированная система управления технологическими процессами', 8, 1, '2019-01-30', '2020-01-28', 2, NULL),
	(NULL, 'Л0355-ИОС5', 'Релейная защита и противоаварийная автоматика', 8, 1, '2019-01-30', '2020-01-28', 2, NULL),
	(NULL, 'Л0355-ИОС6', 'Сети связи', 8, 1, '2019-01-30', '2020-01-18', 2, 'ЦСПИ'),
	(NULL, '0355-150-АСУ', 'Автоматизированная система управления технологическими процессами', 8, 2, '2019-08-01', '2020-05-28', 2, NULL),
	(NULL, '0355-102-РЗ', 'Релейная защита и автоматика', 8, 2, '2019-08-01', '2020-05-28', 2, NULL),
	(NULL, '0355-114-РЗ', 'Параметрирование терминалов РЗ и ПА', 8, 2, '2019-08-01', '2020-05-28', 2, NULL),
	(NULL, '0355-025-СС', 'Внутриобъектные комплексы связи', 8, 2, '2019-08-01', '2020-05-28', 2, NULL),
	(NULL, '0355-004-СС', 'Станционные сооружения ВОЛС', 8, 2, '2019-08-01', '2020-05-28', 2, NULL),
	(NULL, '0355-ППО', 'Предпроектное обследование', 8, 4, '2019-01-30', '2019-03-22', 2, NULL),
	(NULL, '0355-КД', 'Конкурсная документация', 8, 3, '2020-04-20', '2020-06-01', 2, NULL),
	-- 'Комплексная реконструкция ПС 330 кВ Колпино'
	(NULL, 'П0360-ИОС4.1', 'Автоматизированная система управления технологическими процессами', 9, 1, '2019-02-01', '2020-01-20', 2, NULL),
	(NULL, 'П0360-ИОС5.1', 'Релейная защита и противоаварийная автоматика', 9, 1, '2019-02-01', '2020-01-20', 2, NULL),
	(NULL, 'П0360-ИОС6.1', 'Сети связи', 9, 1, '2019-02-05', '2020-01-20', 2, 'ЦСПИ'),
	(NULL, '0360-150-АСУ', 'Автоматизированная система управления технологическими процессами', 9, 2, '2019-06-01', '2020-06-21', 2, NULL),
	(NULL, '0360-102-РЗ', 'Релейная защита и автоматика', 9, 2, '2019-06-01', '2020-06-21', 2, NULL),
	(NULL, '0360-114-РЗ', 'Параметрирование терминалов РЗ и ПА', 9, 2, '2019-06-01', '2020-06-21', 2, NULL),
	(NULL, '0360-025-СС', 'Внутриобъектные комплексы связи', 9, 2, '2019-06-25', '2020-06-21', 2, NULL),
	(NULL, '0360-004-СС', 'Станционные сооружения ВОЛС', 9, 2, '2019-06-25', '2020-06-18', 2, NULL),
	(NULL, '0360-ППО', 'Предпроектное обследование', 9, 4, '2019-02-12', '2019-03-30', 2, NULL),
	(NULL, '0360-КД', 'Конкурсная документация', 9, 3, '2020-05-23', '2020-06-23', 2, NULL),
	-- 'Техническое перевооружение ТП Черная Восточно-Сибирской ж.д.'
	(NULL, 'ТП1355-ИОС4', 'Автоматизированная система управления технологическими процессами', 10, 1, '2019-02-28', '2019-12-26', 5, NULL),
	(NULL, 'ТП1355-ИОС5', 'Релейная защита и противоаварийная автоматика', 10, 1, '2019-02-28', '2019-12-12', 5, NULL),
	(NULL, 'ТП1355-ИОС6', 'Сети связи', 10, 1, '2019-03-01', '2019-12-12', 5, 'СПД'),
	(NULL, '1355-150-АСУ', 'Автоматизированная система управления технологическими процессами', 10, 2, '2019-04-28', '2020-02-15', 5, NULL),
	(NULL, '1355-102-РЗ', 'Релейная защита и автоматика', 10, 2, '2019-04-28', '2020-02-15', 5, NULL),
	(NULL, '1355-114-РЗ', 'Параметрирование терминалов РЗ и ПА', 10, 2, '2019-04-28', '2020-02-15', 5, NULL),
	(NULL, '1355-025-СС', 'Внутриобъектные комплексы связи', 10, 2, '2019-07-28', '2020-02-15', 5, NULL),
	(NULL, '1355-004-СС', 'Станционные сооружения ВОЛС', 10, 2, '2019-04-28', '2020-02-15', 5, NULL),
	(NULL, '1355-ППО', 'Предпроектное обследование', 10, 4, '2019-02-26', '2019-03-25', 5, NULL),
	(NULL, '1355-КД', 'Конкурсная документация', 10, 3, '2020-01-10', '2020-02-10', 5, NULL),
	-- 'Строительство КВЛ Ленинградская АЭС-2 - Пулковская - Южная'
	(NULL, 'КЛ0070-ИОС4', 'Автоматизированная система управления технологическими процессами', 11, 1, '2019-03-28', '2019-12-26', 5, NULL),
	(NULL, 'КЛ0070-ИОС5', 'Релейная защита и противоаварийная автоматика', 11, 1, '2019-03-28', '2019-12-12', 5, NULL),
	(NULL, 'КЛ0070-ИОС6', 'Сети связи', 11, 1, '2019-03-28', '2019-12-01', 5, 'СПД'),
	(NULL, '0070-150-АСУ', 'Автоматизированная система управления технологическими процессами', 11, 2, '2019-05-28', '2020-03-01', 5, NULL),
	(NULL, '0070-102-РЗ', 'Релейная защита и автоматика', 11, 2, '2019-05-28', '2020-03-01', 5, NULL),
	(NULL, '0070-114-РЗ', 'Параметрирование терминалов РЗ и ПА', 11, 2, '2019-05-28', '2020-03-01', 5, NULL),
	(NULL, '0070-025-СС', 'Внутриобъектные комплексы связи', 11, 2, '2019-05-28', '2020-03-01', 5, NULL),
	(NULL, '0070-004-СС', 'Станционные сооружения ВОЛС', 11, 2, '2019-05-28', '2020-03-01', 5, NULL),
	(NULL, '0070-ППО', 'Предпроектное обследование', 11, 4, '2019-03-26', '2019-04-25', 5, NULL),
	(NULL, '0070-КД', 'Конкурсная документация', 11, 3, '2020-01-30', '2020-03-30', 5, NULL),
	-- 'Реконструкция и расширение ПС 110 кВ 'Красный Октябрь''
	(NULL, 'П0215-ИОС4', 'Автоматизированная система управления технологическими процессами', 12, 1, '2019-03-27', '2019-12-02', 7, NULL),
	(NULL, 'П0215-ИОС5', 'Релейная защита и противоаварийная автоматика', 12, 1, '2019-03-27', '2019-12-02', 7, NULL),
	(NULL, 'П0215-ИОС6', 'Сети связи', 12, 1, '2019-03-27', '2019-12-02', 7, NULL),
	(NULL, '0215-150-АСУ', 'Автоматизированная система управления технологическими процессами', 12, 2, '2019-10-27', DEFAULT, 7, NULL),
	(NULL, '0215-110-РЗ', 'Релейная защита и автоматика', 12, 2, '2019-10-27', DEFAULT, 7, NULL),
	(NULL, '0215-114-РЗ', 'Параметрирование терминалов РЗ и ПА', 12, 2, '2019-11-27', DEFAULT, 7, NULL),
	(NULL, '0215-025-СС', 'Внутриобъектные комплексы связи', 12, 2, '2019-10-30', DEFAULT, 7, NULL),
	(NULL, '0215-004-СС', 'Станционные сооружения ВОЛС', 12, 2, '2020-01-27', DEFAULT, 7, NULL),
	(NULL, '0215-ППО', 'Предпроектное обследование', 12, 4, '2019-03-28', '2019-05-25', 6, NULL),
	(NULL, '0215-КД', 'Конкурсная документация', 12, 3, '2020-06-30', DEFAULT, 6, NULL),
	-- 'Реконструкция ОРУ 110 кВ ЭС-1 Центральной ТЭЦ филиала Невский'
	(NULL, 'П0255-ИОС4', 'Автоматизированная система управления технологическими процессами', 13, 1, '2019-04-01', '2019-12-01', 5, NULL),
	(NULL, 'П0255-ИОС5', 'Релейная защита и противоаварийная автоматика', 13, 1, '2019-04-01', '2019-12-01', 5, NULL),
	(NULL, 'П0255-ИОС6', 'Сети связи', 13, 1, '2019-04-01', '2019-12-01', 5, NULL),
	(NULL, '0255-150-АСУ', 'Автоматизированная система управления технологическими процессами', 13, 2, '2019-12-01', DEFAULT, 5, NULL),
	(NULL, '0255-110-РЗ', 'Релейная защита и автоматика', 13, 2, '2019-12-01', DEFAULT, 5, NULL),
	(NULL, '0255-114-РЗ', 'Параметрирование терминалов РЗ и ПА', 13, 2, '2019-12-01', DEFAULT, 5, NULL),
	(NULL, '0255-026-СС', 'Внутриобъектные комплексы связи', 13, 2, '2019-12-01', DEFAULT, 5, NULL),
	(NULL, '0255-004-СС', 'Станционные сооружения ВОЛС', 13, 2, '2019-12-01', DEFAULT, 5, NULL),
	(NULL, '0255-ППО', 'Предпроектное обследование', 13, 4, '2019-04-05', '2019-06-01', 5, NULL),
	(NULL, '0255-КД', 'Конкурсная документация', 13, 3, '2020-06-25', DEFAULT, 5, NULL),
	-- 'Техническое перевооружение ТП Старый Оскол. Организация ССПИ'
	(NULL, 'ТП1360-ИОС4', 'Автоматизированная система управления технологическими процессами', 14, 1, '2020-03-29', DEFAULT, 5, NULL),
	(NULL, 'ТП1360-ИОС5', 'Релейная защита и противоаварийная автоматика', 14, 1, '2020-03-29', DEFAULT, 5, NULL),
	(NULL, 'ТП1360-ИОС6', 'Сети связи', 14, 1, '2020-03-29', DEFAULT, 5, NULL),
	(NULL, '1360-150-АСУ', 'Автоматизированная система управления технологическими процессами', 14, 2, '2020-07-01', DEFAULT, 5, NULL),
	(NULL, '1360-110-РЗ', 'Релейная защита и автоматика', 14, 2, '2020-07-01', DEFAULT, 5, NULL),
	(NULL, '1360-114-РЗ', 'Параметрирование терминалов РЗ и ПА', 14, 2, '2020-07-01', DEFAULT, 5, NULL),
	(NULL, '1360-026-СС', 'Внутриобъектные комплексы связи', 14, 2, '2020-07-10', DEFAULT, 5, NULL),
	(NULL, '1360-004-СС', 'Станционные сооружения ВОЛС', 14, 2, '2020-07-10', DEFAULT, 5, NULL),
	(NULL, '1360-ППО', 'Предпроектное обследование', 14, 4, '2020-02-10', '2020-04-29', 6, NULL),
	(NULL, '1360-КД', 'Конкурсная документация', 14, 3, '2020-07-10', DEFAULT, 6, NULL),
	-- 'Схема выдачи мощности второй очереди ЛАСЭ-2'
	(NULL, 'Р0002-ИОС4', 'АСУТП и АИИС КУЭ', 15, 1, '2020-05-18', DEFAULT, 2, NULL),
	(NULL, 'Р0002-ИОС5', 'Противоаварийная автоматика', 15, 1, '2020-05-18', DEFAULT, 2, NULL),
	(NULL, 'Р0002-ИОС6', 'Сети связи', 15, 1, '2020-05-18', DEFAULT, 2, NULL),
	(NULL, 'РМ002-150-АСУ', 'Автоматизированная система управления технологическими процессами', 15, 2, '2020-06-10', DEFAULT, 4, NULL),
	(NULL, 'РМ002-300-РР', 'Расчет режимов', 15, 2, '2020-06-10', DEFAULT, 4, NULL),
	(NULL, 'РМ002-114-РЗ', 'Параметрирование терминалов РЗ и ПА', 15, 2, '2020-06-10', DEFAULT, 4, NULL),
	(NULL, 'РМ002-026-СС', 'Внутриобъектные комплексы связи', 15, 2, '2020-06-10', DEFAULT, 4, NULL),
	(NULL, 'РМ002-004-СС', 'Станционные сооружения ВОЛС', 15, 2, '2020-06-10', DEFAULT, 4, NULL),
	(NULL, 'РМ002-ППО', 'Предпроектное обследование', 15, 4, '2020-05-16', DEFAULT, 4, NULL),
	(NULL, 'РМ002-КД', 'Конкурсная документация', 15, 3, '2020-07-25', DEFAULT, 4, NULL);

INSERT INTO versions VALUES
	-- '4 участок ВЛ 330 кВ Кольская АЭС-Княжегубская ГЭС, ПС 330 кВ Лоухи-Путкинская ГЭС'
	(NULL, 1, 0, '2018-12-12', false), (NULL, 1, 1, '2019-01-12', false), (NULL, 1, 2, '2019-01-15', true),
	(NULL, 2, 0, '2018-12-12', false), (NULL, 2, 1, '2019-01-12', false), (NULL, 2, 2, '2019-01-15', true),
	(NULL, 3, 0, '2018-11-12', false), (NULL, 3, 1, '2018-12-30', true),
	(NULL, 4, 0, '2018-11-15', false), (NULL, 4, 1, '2019-04-30', false), (NULL, 4, 2, '2019-05-30', true),
	(NULL, 5, 0, '2018-11-15', false), (NULL, 5, 1, '2019-04-30', false), (NULL, 5, 2, '2019-05-30', true),
	(NULL, 6, 0, '2018-11-15', false), (NULL, 6, 1, '2019-04-24', false), (NULL, 6, 2, '2019-06-01', true),
	(NULL, 7, 0, '2018-11-15', false), (NULL, 7, 1, '2019-04-27', false), (NULL, 7, 2, '2019-06-10', true),
	(NULL, 8, 0, '2018-11-15', false), (NULL, 8, 1, '2019-04-27', true), (NULL, 9, 0, '2018-10-25', true), 
	(NULL, 10, 0, '2018-11-02', true),
	-- 'ПС 330 кВ Василеостровская с КЛ 330 кВ Василеостровская-Северная'
	(NULL, 11, 0, '2018-12-12', false), (NULL, 11, 1, '2019-04-12', false), (NULL, 11, 2, '2019-05-15', true),
	(NULL, 12, 0, '2018-12-12', false), (NULL, 12, 1, '2019-04-12', false), (NULL, 12, 2, '2019-05-15', true),
	(NULL, 13, 0, '2018-11-12', false), (NULL, 13, 1, '2019-05-30', true),
	(NULL, 14, 0, '2018-11-15', false), (NULL, 14, 1, '2019-09-30', true),
	(NULL, 15, 0, '2018-11-15', false), (NULL, 15, 1, '2019-09-28', true),
	(NULL, 16, 0, '2018-11-15', false), (NULL, 16, 1, '2019-09-30', true),
	(NULL, 17, 0, '2018-11-15', false), (NULL, 17, 1, '2019-09-01', false), (NULL, 17, 2, '2019-10-28', true),
	(NULL, 18, 0, '2018-11-15', false), (NULL, 18, 1, '2019-10-30', true), (NULL, 19, 0, '2018-06-15', true), 
	(NULL, 20, 0, '2018-10-20', true),
	-- 'ПС 110 кВ 'Намыв-2' с КЛ 110 кВ'
	(NULL, 21, 0, '2018-12-12', false), (NULL, 21, 1, '2019-01-12', false), (NULL, 21, 2, '2019-01-30', true),
	(NULL, 22, 0, '2018-12-12', false), (NULL, 22, 1, '2019-01-12', false), (NULL, 22, 2, '2019-01-30', true),
	(NULL, 23, 0, '2018-12-12', false), (NULL, 23, 1, '2019-01-30', true),
	(NULL, 24, 0, '2018-12-15', false), (NULL, 24, 1, '2019-01-30', true),
	(NULL, 25, 0, '2018-12-15', false), (NULL, 25, 1, '2019-01-28', true),
	(NULL, 26, 0, '2018-09-15', false), (NULL, 26, 1, '2019-05-30', true),
	(NULL, 27, 0, '2018-09-15', false), (NULL, 27, 1, '2019-05-16', false), 
	(NULL, 27, 2, '2019-07-28', true),(NULL, 28, 0, '2018-10-15', false), 
	(NULL, 28, 1, '2019-05-30', true), (NULL, 29, 0, '2018-09-15', true), (NULL, 30, 0, '2018-10-20', true),
	-- 'Комплексное техническое перевооружение ПС 500 кВ Бескудниково'
	(NULL, 31, 0, '2019-04-12', true), (NULL, 32, 0, '2019-04-12', true), (NULL, 33, 0, '2019-04-12', true), 
	(NULL, 34, 0, '2019-08-12', true),(NULL, 35, 0, '2018-09-12', false), (NULL, 35, 1, '2019-07-12', true), 
	(NULL, 36, 0, '2018-09-12', false), (NULL, 36, 1, '2019-07-12', true),
	(NULL, 37, 0, '2018-09-12', false), (NULL, 37, 1, '2019-07-14', true), 
	(NULL, 38, 0, '2019-04-05', true), (NULL, 39, 0, '2018-07-05', true),
	(NULL, 40, 0, '2019-02-06', false), (NULL, 40, 1, '2019-10-05', true),
	-- 'ВЛ 330 кВ Псков-Лужская'
	(NULL, 41, 0, '2018-10-12', true), (NULL, 42, 0, '2018-10-12', true), (NULL, 43, 0, '2018-10-30', true), 
	(NULL, 44, 0, '2019-05-12', true), (NULL, 45, 0, '2019-01-12', false), (NULL, 45, 1, '2019-07-12', true), 
	(NULL, 46, 0, '2019-01-12', false), (NULL, 46, 1, '2019-07-18', true),
	(NULL, 47, 0, '2018-12-12', false), (NULL, 47, 1, '2019-06-14', true), (NULL, 48, 0, '2019-04-05', true), 
	(NULL, 49, 0, '2019-06-05', true), (NULL, 50, 0, '2018-07-06', false), (NULL, 50, 1, '2018-07-30', true), 
	(NULL, 51, 0, '2019-11-05', true),
	-- 'Строительство ПС 500 кВ Белобережская'
	(NULL, 52, 0, '2019-05-12', true), (NULL, 53, 0, '2019-05-12', true), (NULL, 54, 0, '2018-10-30', true), 
	(NULL, 54, 1, '2019-05-30', true), (NULL, 55, 0, '2018-12-12', true), (NULL, 55, 1, '2019-04-12', false), 
	(NULL, 55, 2, '2019-07-19', true), (NULL, 56, 0, '2018-12-12', false), (NULL, 56, 1, '2019-07-12', true), 
	(NULL, 57, 0, '2018-12-12', false), (NULL, 57, 1, '2019-07-12', true),(NULL, 58, 0, '2018-12-12', false), 
	(NULL, 58, 1, '2019-06-14', true), (NULL, 59, 0, '2019-06-05', true), (NULL, 60, 0, '2019-07-01', true),
	(NULL, 61, 0, '2018-07-06', true), (NULL, 62, 0, '2019-11-01', false), (NULL, 62, 1, '2019-11-30', true),
	-- 'Строительство ПС 330 кВ Мурманская'
	(NULL, 63, 0, '2019-07-12', false), (NULL, 64, 0, '2019-08-14', true), (NULL, 65, 0, '2019-10-12', true), 
	(NULL, 66, 0, '2019-08-13', true),(NULL, 67, 0, '2019-09-12', false), (NULL, 67, 1, '2019-11-12', true), 
	(NULL, 68, 0, '2019-09-12', false), (NULL, 68, 1, '2020-01-12', true),(NULL, 69, 0, '2019-10-12', false), 
	(NULL, 69, 1, '2020-02-14', true), (NULL, 70, 0, '2019-04-05', true), (NULL, 71, 0, '2019-03-05', true),
	(NULL, 72, 0, '2020-03-06', false), (NULL, 72, 1, '2020-04-21', true),
	-- 'Строительство ВЛ 220 кВ Харанорская ГЭС - Бугдаинская - Быстринская'
	(NULL, 73, 0, '2019-07-15', true), (NULL, 74, 0, '2019-08-14', true), (NULL, 75, 0, '2019-11-12', true), 
	(NULL, 76, 0, '2020-04-13', true),(NULL, 77, 0, '2019-10-12', false), (NULL, 77, 1, '2020-04-12', true),
	(NULL, 78, 0, '2019-10-11', false), (NULL, 78, 1, '2020-03-12', true),(NULL, 79, 0, '2019-12-12', false), 
	(NULL, 79, 1, '2020-01-14', true), (NULL, 80, 0, '2019-12-05', true), (NULL, 80, 1, '2020-04-05', true),
	(NULL, 81, 0, '2020-02-06', false), (NULL, 81, 1, '2020-03-01', true), (NULL, 82, 0, '2020-05-09', false), 
	(NULL, 82, 1, '2020-05-29', true),
	-- 'Комплексная реконструкция ПС 330 кВ Колпино'
	(NULL, 83, 0, '2019-10-12', true), (NULL, 84, 0, '2019-10-14', true), (NULL, 85, 0, '2019-10-12', true), 
	(NULL, 86, 0, '2019-05-15', true), (NULL, 87, 0, '2020-01-12', false), (NULL, 87, 1, '2020-05-12', true), 
	(NULL, 88, 0, '2020-02-12', false), (NULL, 88, 1, '2020-04-15', true), (NULL, 89, 0, '2019-10-12', false), 
	(NULL, 89, 1, '2020-02-14', true), (NULL, 90, 0, '2019-12-05', true), (NULL, 91, 0, '2019-02-05', true),
	(NULL, 92, 0, '2020-06-06', false), (NULL, 92, 1, '2020-06-21', true),
	-- 'Техническое перевооружение ТП Черная Восточно-Сибирской ж.д.'
	(NULL, 93, 0, '2019-07-12', true), (NULL, 94, 0, '2019-07-14', true), (NULL, 95, 0, '2019-07-12', true), 
	(NULL, 96, 0, '2019-12-15', true),(NULL, 97, 0, '2019-11-12', false), (NULL, 97, 1, '2020-01-12', true), 
	(NULL, 98, 0, '2019-06-12', false), (NULL, 98, 1, '2020-01-15', true),(NULL, 99, 0, '2019-11-12', false), 
	(NULL, 99, 1, '2020-01-14', true), (NULL, 100, 0, '2020-01-25', true), (NULL, 101, 0, '2019-03-01', true),
	(NULL, 102, 0, '2020-02-06', false), (NULL, 102, 1, '2020-02-21', false), (NULL, 102, 2, '2020-03-01', false), 
	(NULL, 102, 3, '2020-03-21', true),
	-- 'Строительство КВЛ Ленинградская АЭС-2 - Пулковская - Южная'
	(NULL, 103, 0, '2019-06-12', true), (NULL, 104, 0, '2019-06-14', true), (NULL, 105, 0, '2019-06-12', true), 
	(NULL, 106, 0, '2019-12-15', true),(NULL, 107, 0, '2019-06-12', false), (NULL, 107, 1, '2020-02-01', true), 
	(NULL, 108, 0, '2019-07-12', false), (NULL, 108, 1, '2020-02-15', true), (NULL, 109, 0, '2019-12-12', true), 
	(NULL, 109, 1, '2020-01-14', true), (NULL, 110, 0, '2020-01-11', true), (NULL, 111, 0, '2019-04-02', true),
	(NULL, 112, 0, '2020-02-06', false), (NULL, 112, 1, '2020-03-21', true),
	-- 'Реконструкция и расширение ПС 110 кВ 'Красный Октябрь''
	(NULL, 113, 0, '2019-10-12', true), (NULL, 114, 0, '2019-10-14', true), (NULL, 115, 0, '2019-10-12', true), 
	(NULL, 116, 0, '2019-12-15', false), (NULL, 117, 0, '2019-12-12', false), (NULL, 118, 0, '2019-12-12', false),
	(NULL, 119, 0, '2019-12-12', false), (NULL, 120, 0, '2020-01-10', true), (NULL, 121, 0, '2019-04-02', false) , 
	(NULL, 121, 1, '2019-05-02', true), (NULL, 122, 0, '2020-07-06', false), 
	-- 'Реконструкция ОРУ 110 кВ ЭС-1 Центральной ТЭЦ филиала Невский'
	(NULL, 123, 0, '2019-04-12', true), (NULL, 123, 1, '2019-10-12', true), (NULL, 124, 0, '2019-08-14', true), 
	(NULL, 125, 0, '2019-08-12', true), (NULL, 126, 0, '2020-02-15', false), (NULL, 127, 0, '2020-02-15', false), 
	(NULL, 128, 0, '2020-02-20', false),(NULL, 129, 0, '2020-01-30', false), (NULL, 130, 0, '2020-01-19', true), 
	(NULL, 131, 0, '2019-05-11', false) , (NULL, 131, 1, '2019-05-20', true), (NULL, 132, 0, '2020-06-26', false), 
		-- 'Техническое перевооружение ТП Старый Оскол. Организация ССПИ'
	(NULL, 133, 0, '2020-04-12', false), (NULL, 134, 0, '2020-04-14', true), (NULL, 135, 0, '2020-04-12', false), 
	(NULL, 136, 0, '2020-07-02', false), (NULL, 137, 0, '2020-07-02', false), (NULL, 138, 0, '2020-07-02', false),
	(NULL, 139, 0, '2020-07-15', false), (NULL, 140, 0, '2020-07-15', false), (NULL, 141, 0, '2020-02-20', false) , 
	(NULL, 141, 1, '2020-03-01', true), (NULL, 142, 0, '2020-07-25', false), 
	-- 'Схема выдачи мощности второй очереди ЛАСЭ-2'
	(NULL, 143, 0, '2020-06-12', true), (NULL, 144, 0, '2020-06-14', true), (NULL, 145, 0, '2020-06-12', true), 
	(NULL, 146, 0, '2020-07-02', false), (NULL, 147, 0, '2020-07-01', false), (NULL, 148, 0, '2020-07-01', false),
	(NULL, 149, 0, '2020-07-03', false), (NULL, 150, 0, '2020-07-01', false), (NULL, 151, 0, '2020-05-29', true),
	(NULL, 152, 0, '2020-07-26', false);

INSERT INTO invoices VALUES
	(NULL, 'ПИР-101-И-2019-001', '2019-03-20', DEFAULT, 4, 21), -- 1
	(NULL, 'ПИР-101-И-2019-002', '2019-04-20', DEFAULT, 4, 21), -- 2
	(NULL, 'ПИР-111-И-2019-001', '2019-07-05', DEFAULT, 4, 21), -- 3
	(NULL, 'ПИР-111-И-2019-002', '2019-12-28', DEFAULT, 4, 21), -- 4
	(NULL, 'ПИР-115-И-2019-001', '2019-05-30', DEFAULT, 2, 20), -- 5
	(NULL, 'ПИР-115-И-2019-002', '2019-11-01', DEFAULT, 2, 20), -- 6
	(NULL, 'ПИР-118-И-2019-001', '2019-09-30', DEFAULT, 1, 21), -- 7
	(NULL, 'ПИР-118-И-2019-002', '2019-11-30', DEFAULT, 1, 21), -- 8
	(NULL, 'ПИР-119-И-2019-001', '2019-03-15', DEFAULT, 4, 21), -- 9
	(NULL, 'ПИР-119-И-2019-002', '2019-12-15', DEFAULT, 4, 21), -- 10
	(NULL, 'ПИР-121-И-2019-001', '2019-11-29', DEFAULT, 4, 21), -- 11
	(NULL, 'ПИР-121-И-2019-002', '2019-12-21', DEFAULT, 4, 21), -- 12
	(NULL, 'ПИР-125-И-2020-001', '2020-01-30', DEFAULT, 4, 20), -- 13
	(NULL, 'ПИР-125-И-2020-002', '2020-12-21', DEFAULT, 4, 20), -- 14
	(NULL, 'ПИР-130-И-2020-001', '2020-04-01', 12, 5, 20), -- 15
	(NULL, 'ПИР-130-И-2020-002', '2020-06-15', 12, 5, 20), -- 16
	(NULL, 'ПИР-141-И-2020-001', '2020-07-01', 8, 4, 21), -- 17
	(NULL, 'ПИР-141-И-2020-002', '2020-07-30', 8, 4, 21), -- 18
	(NULL, 'ПИР-145-И-2020-001', '2020-02-20', DEFAULT, 3, 21), -- 19
	(NULL, 'ПИР-145-И-2020-002', '2020-04-15', DEFAULT, 3, 21), -- 20
	(NULL, 'ПИР-165-И-2020-001', '2020-04-02', DEFAULT, 6, 21), -- 21
	(NULL, 'ПИР-165-И-2020-002', '2020-05-15', DEFAULT, 6, 21), -- 22
	(NULL, 'ПИР-168-И-2020-001', '2020-01-15', DEFAULT, 2, 21), -- 23
	(NULL, 'ПИР-168-И-2020-002', '2020-02-02', DEFAULT, 2, 21), -- 24
	(NULL, 'ПИР-170-И-2020-001', '2020-01-15', DEFAULT, 6, 21), -- 25
	(NULL, 'ПИР-170-И-2020-002', '2020-02-02', DEFAULT, 6, 21), -- 26
	(NULL, 'ПИР-172-И-2020-001', '2020-04-20', 2, 3, 21), -- 27
	(NULL, 'ПИР-174-И-2020-001', '2020-06-20', DEFAULT, 1, 21); -- 28
	
INSERT INTO dispatches VALUES
	(NULL, 1, 3), (NULL, 1, 6), (NULL, 1, 8), (NULL, 1, 23), (NULL, 1, 24), -- 	project_id 1
	(NULL, 2, 10), (NULL, 2, 14), (NULL, 2, 17), (NULL, 2, 20), -- 	project_id 1
	(NULL, 3, 27), (NULL, 3, 30), (NULL, 3, 32), (NULL, 3, 44), (NULL, 3, 45), -- project_id 2
	(NULL, 4, 34), (NULL, 4, 36), (NULL, 4, 38), (NULL, 4, 41),-- project_id 2
	(NULL, 5, 48), (NULL, 5, 51), (NULL, 5, 53), (NULL, 5, 55),(NULL, 5, 57), (NULL, 5, 65), (NULL, 5, 66), -- project_id 3
	(NULL, 6, 59), (NULL, 6, 62), (NULL, 6, 64), -- project_id 3
	(NULL, 7, 67), (NULL, 7, 68), (NULL, 7, 69), (NULL, 7, 77), (NULL, 7, 78), -- project_id 4
	(NULL, 8, 70), (NULL, 8, 72), (NULL, 8, 74), (NULL, 8, 76), (NULL, 8, 80), -- project_id 4 ***
	(NULL, 9, 81), (NULL, 9, 82), (NULL, 9, 83), (NULL, 9, 94), -- project_id 5
	(NULL, 10, 84), (NULL, 10, 86), (NULL, 10, 90), (NULL, 10, 91), (NULL, 10, 92), (NULL, 10, 95), -- project_id 5
	(NULL, 11, 98), (NULL, 11, 100), (NULL, 11, 111), -- project_id 6
	(NULL, 12, 96), (NULL, 12, 97), (NULL, 12, 99), (NULL, 12, 102), (NULL, 12, 104), (NULL, 12, 108), (NULL, 12, 109), (NULL, 12, 110), -- project_id 6
	(NULL, 13, 114), (NULL, 13, 115), (NULL, 13, 116),  (NULL, 13, 125), -- project_id 7
	(NULL, 14, 117), (NULL, 14, 119), (NULL, 14, 121),  (NULL, 14, 123), (NULL, 14, 124),  (NULL, 14, 127),-- project_id 7
	(NULL, 15, 128), (NULL, 15, 129), (NULL, 15, 130),  (NULL, 15, 138), -- project_id 8
	(NULL, 16, 131), (NULL, 16, 133), (NULL, 16, 135),  (NULL, 16, 137), (NULL, 16, 139), (NULL, 16, 141),  (NULL, 16, 143), -- project_id 8
	(NULL, 17, 144), (NULL, 17, 145), (NULL, 17, 146),  (NULL, 17, 147), (NULL, 17, 154), (NULL, 17, 155), -- project_id 9
	(NULL, 18, 149), (NULL, 18, 151), (NULL, 18, 153),  (NULL, 18, 157), -- project_id 9
	(NULL, 19, 158), (NULL, 19, 159), (NULL, 19, 160),  (NULL, 19, 161), (NULL, 19, 169), -- project_id 10
	(NULL, 20, 163), (NULL, 20, 165), (NULL, 20, 167),  (NULL, 20, 168), (NULL, 20, 173), -- project_id 10
	(NULL, 21, 174), (NULL, 21, 175), (NULL, 21, 176),  (NULL, 21, 177), (NULL, 21, 182), (NULL, 21, 185), -- project_id 11
	(NULL, 22, 179), (NULL, 22, 181), (NULL, 22, 183),  (NULL, 22, 184), (NULL, 22, 187), -- project_id 11
	(NULL, 23, 188), (NULL, 23, 189), (NULL, 23, 190),  (NULL, 23, 197), -- project_id 12
	(NULL, 24, 195), -- project_id 12
	(NULL, 25, 199), (NULL, 25, 200), (NULL, 25, 201),  (NULL, 25, 202), -- project_id 13
	(NULL, 26, 207), -- project_id 13
	(NULL, 27, 212), (NULL, 27, 220), -- project_id 14
	(NULL, 28, 222), (NULL, 28, 223), (NULL, 28, 224), (NULL, 28, 230); -- project_id 15
	
	
	