USE doc_flow;

INSERT INTO departments VALUES
	(NULL, 'департамент систем управления'),
	(NULL, 'департамент реализации инвестиционных проектов'),
	(NULL, 'департамент капитального строительства'),
	(NULL, 'руководство');

INSERT INTO divisions VALUES
	(NULL, 'отдел ОСС', 1),
	(NULL, 'отдел АСУТП', 1),
	(NULL, 'отдел РЗАиПА', 1),
	(NULL, 'отдел подготовки проектов', 2),
	(NULL, 'отдел бюджетирования и финансирования', 2),
	(NULL, 'отдел сметной аналитики', 2),
	(NULL, 'генплана, силового оборудования и транспорта', 3),
	(NULL, 'архитектурный отдел', 3),
	(NULL, 'аппарат генерального директора', 4);
	
INSERT INTO positions VALUES
	(NULL, 'специалист 3 категории'), (NULL, 'специалист 2 категории'),
	(NULL, 'специалист 1 категории'), 	(NULL, 'ведущий специалист'),
	(NULL, 'главный специалист'), (NULL, 'начальник отдела'),
	(NULL, 'главный иженер'), (NULL, 'заместитель генерального директора'),
	(NULL, 'генеральный директор'), (NULL, 'секретарь');
	
INSERT INTO phone_numbers VALUES 
	(NULL, 88125555550), (NULL, 88125555551), (NULL, 88125555552), (NULL, 88125555553), 
	(NULL, 88125555554), (NULL, 88125555555), (NULL, 88125555556), (NULL, 88125555557),
	(NULL, 88125555558), (NULL, 88125555559), (NULL, 88125555560), (NULL, 88125555561), (NULL, 88125555562);
	
INSERT INTO stages VALUES (NULL, 'ПД'), (NULL, 'РД'), (NULL, 'КД'), (NULL, 'ППО');

INSERT INTO cities VALUES (NULL, 'Москва'), (NULL, 'Санкт-Петербург'), (NULL, 'Кемерово'), (NULL, 'Красноярск');

INSERT INTO expertises VALUES
	(NULL, 'ФАУ Главгосэкспертиза России', 1, 'Фуркасовский пер., д. 6', 'info@gge.ru', 74956259595),
	(NULL, 'ГАУ Леноблэкспертиза', 2, 'Малоохтинский пр., дом 68', 'info@loexp.ru', 78123334763),
	(NULL, 'ГАУ Госэкспертиза Кузбасса', 3, 'ул. Терешковой, д.18', 'ekspertko@mail.ru', 73842346601),
	(NULL, 'ГАУ Московская государственная экспертиза', 1, 'ул.2-я Брестская, д. 8', 'info@mge.mos.ru', 74992510170),
	(NULL, 'ГАУ Центр государственной экспертизы', 2, 'ул. Зодчего Росси, дом 1/3', 'info@spbexp.ru', 78127770432);

INSERT INTO subcontractors VALUES
	(NULL, 'АО СмартТехПроект', 2, 'пл. Ал. Невского д.2 лит.Б', 'office@rosproject.com', 88124564755, 'Семенова С.А.', 'Иванов П.П.'),
	(NULL, 'АО ЭнергоПроект', 2, 'ул. Боровая, д. 32, лит. Н', 'info@energopro.ru', 78122427169, 'Николаев Н.Н.', 'Максимов М.М.'),
	(NULL, 'ЗАО Энергопроект', 1, 'Каширское ш., д.22к3', 'info@ntc-power.ru', 74957271909, 'Борисов Б.Б.', 'Столов М.В.'),
	(NULL, 'ООО Петроком', 2, 'Мурзинская ул., 11', 'info@petrokom.com', 88123312517, 'Артемов А.А.', 'Светлов М.В.'),
	(NULL, 'АО Атомпроект', 1, 'пл. Свободы, д.3', 'niaep@ase-ec.ru', 84953312617, 'Григорьев Г.Г.', 'Листьев М.А.');

INSERT INTO gencontractors VALUES
	(NULL, 'ООО ЛЭМ', 1, 'Киевское шоссе, 22-й км', 'info@lem-ltd.ru', 74996840016, 'Афанасьев Б.А.', 'Кукуев Х.П.'),
	(NULL, 'ООО АРСЕНАЛ ПЛЮС', 1, '1-й Дербеневский пер., д. 5', 'info@arsenal-pl.ru', 74993725261, 'Иванова З.Н.', 'Лепский М.О.'),
	(NULL, 'ЗАО Юнител Инжиниринг', 1, '2-я Кабельная, д. 2, стр.1', 'info@uni-eng.ru', 74956519998, 'Рыжов А.Б.', 'Дегтярев А.В.'),
	(NULL, 'ООО АББ', 2, 'Гельсингфорсская ул., 4', 'info@abb.com', 78123329900, 'Дулов В.А.', 'Арбенин М.Л.');	
	
INSERT INTO customers VALUES
	(NULL, 'ПАО ФСК ЕЭС МЭС Центра', 1, 'ул. Беловежская, д. 4', 'center@fsk-ees.ru', 74957109655, 'Муров Б.А.', 'Абрамов И.П.'),
	(NULL, 'ПАО Ленэнерго', 2, 'ул.Красного Текстильщика, 10-12', 'service@lenenergo.ru', 74993725261, 'Швецов С.Н.', 'Абрамович М.А.'),
	(NULL, 'ОАО РЖД', 1, 'Москва, Новая Басманная ул., д. 2', 'office@css.rzd.ru', 74992629095, 'Калашников В.Б.', 'Путин В.В.'),
	(NULL, 'ПАО ФСК ЕЭС МЭС Северо-Запада', 2, 'ул. Беловежская, д. 4', 'sz@fsk-ees.ru', 78127109655, 'Мурова Н.Н.', 'Абрамчук И.А.'),
	(NULL, 'ПАО ФСК ЕЭС МЭС Сибири', 4, 'ул. Ады Лебедевой, 117', 'adm@sibir.fsk-ees.ru', 73912659500 , 'Мишустин Н.Н.', 'Трамп И.А.'),
	(NULL, 'ПАО ТГК-1', 2, 'пр. Добролюбова, 16, корп.2, литера А', 'office.krl@tgc1.ru', 78127122655, 'Солнцев Х.Н.', 'Медведева И.А.');	

INSERT INTO employees VALUES
	(NULL, 'Чебаков', 'Виталий', 'Константинович', 1, 1, 'chebakov_vk@cius-ees.ru', 1, 5),
	(NULL, 'Соколов', 'Владимир', 'Дмитриевич', 1, 1, 'sokolov_vd@cius-ees.ru', 1, 6),
	(NULL, 'Костенко', 'Сергей', 'Георгиевич', 1, 1, 'kostenko_sg@cius-ees.ru', 1, 4),
	(NULL, 'Ткачев', 'Дмитрий', 'Иванович', 1, 2, 'tkachev_di@cius-ees.ru', 2, 4),
	(NULL, 'Зубов', 'Михаил', 'Сергеевич', 1, 2, 'zubov_ms@cius-ees.ru', 2, 3),
	(NULL, 'Мороз', 'Денис', 'Петрович', 1, 2, 'moroz_dp@cius-ees.ru', 2, 6),
	(NULL, 'Мамомнтов', 'Игорь', 'Юрьевич', 1, 3, 'mamontov_iu@cius-ees.ru', 3, 4),
	(NULL, 'Коваленко', 'Иван', 'Владимирович', 1, 3, 'kovalenko_iv@cius-ees.ru', 3, 6),
	(NULL, 'Ковалев', 'Валентин', 'Сергеевич', 2, 4, 'kovalev_vs@cius-ees.ru', 4, 4),
	(NULL, 'Ковалев', 'Алексей', 'Валентинович', 2, 4, 'kovalev_av@cius-ees.ru', 4, 6),
	(NULL, 'Самойлова', 'Ирина', 'Сергеевна', 2, 5, 'samoilova_is@cius-ees.ru', 5, 5),
	(NULL, 'Петров', 'Алексей', 'Валентинович', 2, 5, 'petrov_av@cius-ees.ru', 5, 6),
	(NULL, 'Васильева', 'Галина', 'Петровна', 2, 6, 'vasilieva_gp@cius-ees.ru', 6, 2),
	(NULL, 'Павлов', 'Евгений', 'Александрович', 2, 6, 'pavlov_ea@cius-ees.ru', 6, 6),
	(NULL, 'Васильева', 'Ирина', 'Петровна', 3, 7, 'vasilieva_ip@cius-ees.ru', 7, 4),
	(NULL, 'Павлов', 'Леонид', 'Александрович', 3, 7, 'pavlov_la@cius-ees.ru', 7, 6),
	(NULL, 'Васильев', 'Петр', 'Петрович', 3, 8, 'vasiliev_pp@cius-ees.ru', 8, 5),
	(NULL, 'Павлов', 'Иван', 'Александрович', 3, 8, 'pavlov_ia@cius-ees.ru', 8, 6),
	(NULL, 'Шуринов', 'Василий', 'Александрович', 4, 9, 'shurinov_va@cius-ees.ru', 9, 7),
	(NULL, 'Семенов', 'Петр', 'Петрович', 4, 9, 'semenov_pp@cius-ees.ru', 10, 8),
	(NULL, 'Бадайкин', 'Антон', 'Леонидович', 4, 9, 'badaikin_al@cius-ees.ru', 11, 9),
	(NULL, 'Петрова', 'Эвелина', 'Петровна', 4, 9, 'office@cius-ees.ru', 12, 10);

INSERT INTO projects VALUES 
	(NULL, '4 участок ВЛ 330 кВ Кольская АЭС-Княжегубская ГЭС, ПС 330кВ Лоухи-Путкинская ГЭС', 'ПИР-101', 4, 2, 1, '2018-06-06', '2019-07-01', 1),
	(NULL, 'ПС 330 кВ Василеостровская с КЛ 330 кВ Василеостровская-Северная', 'ПИР-111', 4, 1, 1, '2018-04-08', '2019-12-01', 1),
	(NULL, 'ПС 110 кВ \'Намыв-2\' с КЛ 110 кВ', 'ПИР-115', 2, 4, 2, '2018-04-08', '2019-12-01', 5),
	(NULL, 'Комплексное техническое перевооружение ПС 500 кВ Бескудниково', 'ПИР-118', 1, 1, 1, '2018-05-12', '2019-10-02', 1),
	(NULL, 'ВЛ 330 кВ Псков-Лужская', 'ПИР-119', 4, 2, 1, '2018-06-15', '2019-12-02', 2),
	(NULL, 'Строительство ПС 500 кВ Белобережская', 'ПИР-121', 4, 1, 3, '2018-06-22', '2019-12-28', 4),
	(NULL, 'Строительство ПС 330 кВ Мурманская', 'ПИР-125', 4, 2, 3, '2018-12-22', '2020-05-28', 2),
	(NULL, 'Строительство ВЛ 220 кВ Харанорская ГЭС - Бугдаинская - Быстринская', 'ПИР-130', 5, 1, 1, '2019-01-22', '2020-06-28', 3),
	(NULL, 'Комплексная реконструкция ПС 330 кВ Колпино', 'ПИР-141', 4, 1, 4, '2019-01-23', '2020-07-20', 2),
	(NULL, 'Техническое перевооружение ТП Черная Восточно-Сибирской ж.д.', 'ПИР-145', 3, 4, 4, '2019-02-25', '2020-02-26', 3),
	(NULL, 'Строительство КВЛ Ленинградская АЭС-2 - Пулковская - Южная', 'ПИР-165', 6, 1, 5, '2019-03-25', '2020-04-01', 5),
	(NULL, 'Реконструкция и расширение ПС 110 кВ \'Красный Октябрь\'', 'ПИР-168', 2, 3, 2, '2019-03-25', DEFAULT, 5),
	(NULL, 'Реконструкция ОРУ 110 кВ ЭС-1 Центральной ТЭЦ филиала Невский', 'ПИР-170', 6, 1, 1, '2019-04-01', DEFAULT, 2),
	(NULL, 'Техническое перевооружение ТП Старый Оскол. Организация ССПИ', 'ПИР-172', 3, 3, 4, '2020-01-29', DEFAULT, 4),
	(NULL, 'Схема выдачи мощности второй очереди ЛАСЭ-2', 'ПИР-164', 1, 2, 5, '2020-05-15', DEFAULT, 4);
	
	
	